Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateMassingSketchLine Property
 Line in Massing Sketch is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateMassingSketchLine { get; }
Public Shared ReadOnly Property InaccurateMassingSketchLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateMassingSketchLine {
	FailureDefinitionId^ get ();
}
static member InaccurateMassingSketchLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace